app/controllers/digital_assets/price_data_controller.rb

SELECT "price_histories".* FROM "price_histories" WHERE "price_histories"."digital_asset_id" = $1 AND (close > 0) ORDER BY date_integer_timestamp  [["digital_asset_id", 2]]
---
  def show
    session[:current_digital_asset_id] = params['id']
    @price_histories = current_digital_asset.price_histories
    gon.current_digital_asset = current_digital_asset
    gon.data = current_digital_asset.get_price_history_data.map{|x| [x[:date], x[:price]]}