app/controllers/digital_assets_controller.rb

SELECT "digital_assets".* FROM "digital_assets"
---
  def index
    @digital_assets = DigitalAsset.all

INSERT INTO "digital_assets" ("name", "ticker", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bitcoin"], ["ticker", "BTC"], ["created_at", "2017-08-15 18:51:07.269257"], ["updated_at", "2017-08-15 18:51:07.269257"]]
---
  def create
    @digital_asset = DigitalAsset.new(digital_asset_params)

    respond_to do |format|
      if @digital_asset.save

SELECT  "digital_assets".* FROM "digital_assets" WHERE "digital_assets"."id" = ? LIMIT ?  [["id", 797], ["LIMIT", 1]]
---
    def set_digital_asset
      @digital_asset = DigitalAsset.find(params[:id])