app/controllers/github_profiles_controller.rb

SELECT "github_profiles".* FROM "github_profiles"
---
  def index
    @github_profiles = GithubProfile.all

INSERT INTO "github_profiles" ("org_name", "digital_asset_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["org_name", "bitcoin"], ["digital_asset_id", 1], ["created_at", "2017-08-30 17:44:33.181582"], ["updated_at", "2017-08-30 17:44:33.181582"]]
---
  def create
    @github_profile = GithubProfile.new(github_profile_params)

    respond_to do |format|
      if @github_profile.save

SELECT  "github_profiles".* FROM "github_profiles" WHERE "github_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_github_profile
      @github_profile = GithubProfile.find(params[:id])